(function() { 
/*GENERATED*/
const content = {
  "items": [
    {
      "title": "A2v10:SDK",
      "url": "/index",
      "items": [
        {
          "title": "Что нового",
          "url": "/whatsnew/index",
          "items": [
            {
              "title": "Февраль 2018",
              "url": "/whatsnew/w201802"
            }
          ]
        }
      ]
    },
    {
      "title": "Модели",
      "url": "/models/index",
      "items": [
        {
          "title": "Модели данных",
          "url": "/models/datamodels"
        },
        {
          "title": "model.json",
          "url": "/models/modelfile"
        }
      ]
    },
    {
      "title": "Представления",
      "url": "/views/index",
      "items": [
        {
          "title": "Xaml",
          "url": "/xaml/index",
          "items": [
            {
              "title": "Элементы управления",
              "url": "/xaml/controls/index",
              "items": [
                {
                  "title": "Button",
                  "url": "/xaml/controls/button"
                },
                {
                  "title": "Radio",
                  "url": "/xaml/controls/radio"
                },
                {
                  "title": "Checkbox",
                  "url": "/xaml/controls/checkbox"
                },
                {
                  "title": "MenuItem",
                  "url": "/xaml/controls/menuitem"
                },
                {
                  "title": "Selector",
                  "url": "/xaml/controls/selector"
                },
                {
                  "title": "Table",
                  "url": "/xaml/controls/table"
                },
                {
                  "title": "DataGrid",
                  "url": "/xaml/controls/datagrid"
                }
              ]
            },
            {
              "title": "Контейнеры",
              "url": "/xaml/containers/index",
              "items": [
                {
                  "title": "Block",
                  "url": "/xaml/containers/block"
                },
                {
                  "title": "StackPanel",
                  "url": "/xaml/containers/stackpanel"
                },
                {
                  "title": "Grid",
                  "url": "/xaml/containers/grid"
                },
                {
                  "title": "Splitter",
                  "url": "/xaml/containers/splitter"
                },
                {
                  "title": "DropDownMenu",
                  "url": "/xaml/containers/dropdownmenu"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Контроллеры",
      "url": "/controllers/index",
      "items": [
        {
          "title": "Шаблоны",
          "url": "/template/index",
          "items": [
            {
              "title": "Свойства",
              "url": "/template/properties"
            },
            {
              "title": "События",
              "url": "/template/events"
            },
            {
              "title": "Команды",
              "url": "/template/commands"
            },
            {
              "title": "Валидаторы",
              "url": "/template/validators"
            }
          ]
        }
      ]
    },
    {
      "title": "О справочной системе",
      "url": "/app/about"
    }
  ]
}
;
const files = [{"url":"/index","title":"Платформа А2"},{"url":"/app/about","title":"О программе"},{"url":"/controllers/index","title":"Контроллеры"},{"url":"/models/datamodels","title":"Модели данных"},{"url":"/models/index","title":"Модели"},{"url":"/models/modelfile","title":"Файл model.json"},{"url":"/template/commands","title":"Шаблоны. Команды"},{"url":"/template/events","title":"Шаблоны. События"},{"url":"/template/index","title":"Шаблоны"},{"url":"/template/properties","title":"Шаблоны. Свойства"},{"url":"/template/validators","title":"Шаблоны. Валидаторы"},{"url":"/views/index","title":"Представления"},{"url":"/whatsnew/index","title":"Что нового"},{"url":"/whatsnew/w201802","title":"Что нового. Февраль 2018"},{"url":"/xaml/index","title":"Представления Xaml"},{"url":"/xaml/containers/block","title":"Xaml.Block"},{"url":"/xaml/containers/dropdownmenu","title":"Xaml.DropDownMenu"},{"url":"/xaml/containers/grid","title":"Xaml.Grid"},{"url":"/xaml/containers/index","title":"XAML. Контейнеры"},{"url":"/xaml/containers/splitter","title":"Xaml.Splitter"},{"url":"/xaml/containers/stackpanel","title":"Xaml.StackPanel"},{"url":"/xaml/controls/button","title":"Xaml.Button"},{"url":"/xaml/controls/checkbox","title":"Xaml.CheckBox"},{"url":"/xaml/controls/datagrid","title":"Xaml.DataGrid"},{"url":"/xaml/controls/index","title":"XAML. Элементы управления"},{"url":"/xaml/controls/menuitem","title":"Xaml.MenuItem"},{"url":"/xaml/controls/radio","title":"Xaml.Radio"},{"url":"/xaml/controls/selector","title":"Xaml.Selector"},{"url":"/xaml/controls/table","title":"Xaml.Table"}];
const index = {"Block":[15],"Button":[21],"CheckBox":[22],"commands":[6],"Controls":[24],"DataGrid":[23],"DropDownMenu":[16],"events":[7],"Grid":[17],"Grid.Col":[17],"Grid.ColSpan":[17],"Grid.Row":[17],"Grid.RowSpan":[17],"MenuItem":[25],"model.json":[5],"properties":[9],"Radio":[26],"Selector":[27],"Splitter":[19],"StackPanel":[20],"Table":[28],"template":[8],"validators":[10],"Валидаторы":[10],"Команды":[6],"Контейнеры":[18],"Модели":[4],"Модели данных":[3],"Свойства":[9],"События":[7],"Что нового":[12,13],"Шаблон":[8],"Элементы управления":[24]};
const fts = {"платформа":[0],"а2v10":[0],"справочной":[1,13],"системе":[1],"справочная":[1],"система":[1],"создана":[1],"использованием":[1,13],"программного":[1],"обеспечения":[1],"открытым":[1],"исходным":[1],"кодом:":[1],"vue.js":[1],"copyright":[1],"2014":[1],"2018":[1,12,13],"evan":[1],"you":[1],"домашняя":[1],"страница":[1],"лицензия":[1],"контроллеры":[2],"модели":[3,4,13],"данных":[3,13,17,24],"файл":[5,13],"model.json":[5,13],"шаблоны":[6,7,8,9,10,13],"команды":[6],"события":[7],"свойства":[9,15,16,17,19,20],"валидаторы":[10],"представления":[11,14],"нового":[12],"платформе":[12],"а2":[12],"этом":[12],"разделе":[12],"описываются":[12],"последние":[12],"изменения":[12,24],"дополнения":[12],"программах":[12],"платформы":[12],"версии":[12,13],"10":[12],"текущий":[12],"номер":[12,17],"отображается":[12],"правом":[12],"нижнем":[12],"углу":[12],"окна":[12],"браузера":[12],"выпуск":[12,13],"1":[12,13,17],"февраль":[12,13],"7109":[13],"7119":[13],"выпуски":[13],"|":[13],"предыдущий":[13],"следующий":[13],"общие":[13],"исправлена":[13],"ошибка":[13],"которой":[13],"нельзя":[13],"было":[13],"очистить":[13],"фильтр":[13],"перезагрузки":[13],"страницы":[13],"добавлены":[13],"темы":[13],"пользовательского":[13,17],"интерфейса":[13,17],"добавлена":[13],"возможность":[13],"работы":[13],"пользовательской":[13],"системой":[13],"открытии":[13],"элемента":[13,17],"новом":[13],"окне":[13],"кнопка":[13,24],"закрыть":[13],"закрывает":[13],"окно":[13],"пытается":[13],"перейти":[13],"предыдущую":[13],"страницу":[13],"можно":[13],"открыть":[13],"диалог":[13],"приводило":[13],"к":[13,17],"непредсказуемому":[13],"поведению":[13],"модель":[13],"описания":[13],"параметры":[13],"моделей":[13],"действиях":[13],"actions":[13],"работала":[13],"локализация":[13],"объектах":[13],"вложенными":[13],"свойствами":[13],"например":[13],"таком":[13],"свойстве:":[13],"agent.name":[13],"tagent":[13],"name":[13],"включаемых":[13],"модулях":[13],"require":[13],"xaml":[13,14],"неправильно":[13],"работало":[13],"свойство":[13,17],"disabled":[13],"объекта":[13],"menuitem":[13,24,25],"элемент":[13,15,16,17,19,20,21,22,23,24,25,26,27,28],"dropdownmenu":[13,16,18],"поддерживает":[13],"itemssource":[13],"привязках":[13],"указанным":[13],"форматом":[13],"исправлено":[13],"правой":[13],"нижней":[13],"панели":[13,19],"splitter":[13,18,19],"задавать":[13],"минимально":[13],"допустимую":[13],"ширину":[13],"только":[13],"чтение":[13],"запрещался":[13],"selector":[13,24,27],"добавлен":[13],"taglabel":[13],"tabindex":[13],"кнопок":[13],"button":[13,21,24],"радиокнопок":[13],"radio":[13,24,26],"флажков":[13],"checkbox":[13,22,24],"добавлено":[13],"helpurl":[13],"tablemarkcell":[13],"tablerow":[13],"mark":[13],"объекте":[13],"grid":[13,17,18],"колонок":[13,17],"высоту":[13],"строк":[13,17],"c":[13],"единиц":[13],"измерения":[13],"rem":[13],"em":[13],"отрицание":[13],"условия":[13],"вложенных":[13],"элементов":[13,17,18],"привязки":[13,17],"команд":[13],"bindcmd":[13],"checkargument":[13],"block":[15,18],"контейнеры":[15,16,17,18,19,20],"представляет":[15,16,17,19,20],"собой":[15,16,17,19,20],"контейнер":[15,17,19,20],"содержит":[15],"другие":[15],"элементы":[15,17,18,20,21,22,23,24,25,26,27,28],"управления":[15,17,21,22,23,24,25,26,27,28],"выпадающее":[16,18],"меню":[16,18,24],"сетку":[17],"примечание":[17],"используется":[17],"макетах":[17],"предназначен":[17],"отображения":[17,24],"данным":[17],"используйте":[17],"соответствующие":[17],"упрвления":[17],"как":[17],"table":[17,24,28],"datagrid":[17,23,24],"имя":[17],"тип":[17],"описание":[17],"children":[17],"uielementcollection":[17],"содержимого":[17],"коллекция":[17],"дочерних":[17],"сетки":[17],"унаследовано":[17],"от":[17],"contrainer":[17],"if":[17],"boolean":[17],"включать":[17],"ли":[17],"поток":[17],"рендеринга":[17],"height":[17],"length":[17],"высота":[17],"rows":[17],"rowdefinitions":[17],"определения":[17],"columns":[17],"columndefinitions":[17],"присоединенные":[17,19],"row":[17],"int32":[17],"определяет":[17],"строки":[17],"должен":[17],"быть":[17],"помещен":[17],"дочерний":[17],"col":[17],"колонки":[17],"rowspan":[17],"количество":[17],"будет":[17],"занимать":[17],"умолчанию":[17],"colspan":[17],"valign":[17],"verticalalign":[17],"вертикальное":[17],"выравнивание":[17],"дочернего":[17],"таблицы":[17],"top":[17],"контейнерные":[18],"используются":[18,24],"размещения":[18],"блок":[18],"stackpanel":[18,20],"панель":[18],"сетка":[18],"разделитель":[18],"содержащий":[19],"две":[19],"изменяемыми":[19],"размерами":[19],"котором":[20],"дочерние":[20],"выравниваются":[20],"одну":[20],"линию":[20],"ориентированную":[20],"вертикально":[20],"горизонтально":[20],"controls":[24],"ввода":[24],"радиокнопка":[24],"флажок":[24],"селектор":[24],"таблица":[24]};
window.app = {content: content, files: files, index: index, fts: fts};
})();