(function() { 
/*GENERATED*/
const content = {
  "items": [
    {
      "title": "A2v10:SDK",
      "url": "/index",
      "items": [
        {
          "title": "Что нового",
          "url": "/whatsnew/index",
          "items": [
            {
              "title": "Февраль 2018",
              "url": "/whatsnew/w201802"
            },
            {
              "title": "Март 2018",
              "url": "/whatsnew/w201803"
            }
          ]
        }
      ]
    },
    {
      "title": "Модели",
      "url": "/models/index",
      "items": [
        {
          "title": "Модели данных",
          "url": "/models/datamodels"
        },
        {
          "title": "model.json",
          "url": "/models/modelfile"
        }
      ]
    },
    {
      "title": "Представления",
      "url": "/views/index",
      "items": [
        {
          "title": "Xaml",
          "url": "/xaml/index",
          "items": [
            {
              "title": "Элементы управления",
              "url": "/xaml/controls/index",
              "items": [
                {
                  "title": "Button",
                  "url": "/xaml/controls/button"
                },
                {
                  "title": "Radio",
                  "url": "/xaml/controls/radio"
                },
                {
                  "title": "Checkbox",
                  "url": "/xaml/controls/checkbox"
                },
                {
                  "title": "MenuItem",
                  "url": "/xaml/controls/menuitem"
                },
                {
                  "title": "Selector",
                  "url": "/xaml/controls/selector"
                },
                {
                  "title": "Table",
                  "url": "/xaml/controls/table"
                },
                {
                  "title": "DataGrid",
                  "url": "/xaml/controls/datagrid"
                }
              ]
            },
            {
              "title": "Контейнеры",
              "url": "/xaml/containers/index",
              "items": [
                {
                  "title": "Block",
                  "url": "/xaml/containers/block"
                },
                {
                  "title": "StackPanel",
                  "url": "/xaml/containers/stackpanel"
                },
                {
                  "title": "Grid",
                  "url": "/xaml/containers/grid"
                },
                {
                  "title": "Splitter",
                  "url": "/xaml/containers/splitter"
                },
                {
                  "title": "DropDownMenu",
                  "url": "/xaml/containers/dropdownmenu"
                }
              ]
            },
            {
              "title": "Текстовые элементы",
              "url": "/xaml/text/index",
              "items": [
                {
                  "title": "Text",
                  "url": "/xaml/text/text"
                },
                {
                  "title": "Span",
                  "url": "/xaml/text/span"
                },
                {
                  "title": "TagLabel",
                  "url": "/xaml/text/taglabel"
                },
                {
                  "title": "Hyperlink",
                  "url": "/xaml/text/hyperlink"
                },
                {
                  "title": "Popover",
                  "url": "/xaml/text/popover"
                },
                {
                  "title": "Break",
                  "url": "/xaml/text/break"
                },
                {
                  "title": "Line",
                  "url": "/xaml/text/line"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Контроллеры",
      "url": "/controllers/index",
      "items": [
        {
          "title": "Шаблоны",
          "url": "/template/index",
          "items": [
            {
              "title": "Свойства",
              "url": "/template/properties"
            },
            {
              "title": "События",
              "url": "/template/events"
            },
            {
              "title": "Команды",
              "url": "/template/commands"
            },
            {
              "title": "Валидаторы",
              "url": "/template/validators"
            }
          ]
        }
      ]
    },
    {
      "title": "О справочной системе",
      "url": "/app/about"
    }
  ]
}
;
const files = [{"url":"/index","title":"Платформа А2"},{"url":"/app/about","title":"О программе"},{"url":"/controllers/index","title":"Контроллеры"},{"url":"/models/datamodels","title":"Модели данных"},{"url":"/models/index","title":"Модели"},{"url":"/models/modelfile","title":"Файл model.json"},{"url":"/template/commands","title":"Шаблоны. Команды"},{"url":"/template/events","title":"Шаблоны. События"},{"url":"/template/index","title":"Шаблоны"},{"url":"/template/properties","title":"Шаблоны. Свойства"},{"url":"/template/validators","title":"Шаблоны. Валидаторы"},{"url":"/views/index","title":"Представления"},{"url":"/whatsnew/index","title":"Что нового"},{"url":"/whatsnew/w201802","title":"Что нового. Февраль 2018"},{"url":"/whatsnew/w201803","title":"Что нового. Март 2018"},{"url":"/xaml/index","title":"Представления Xaml"},{"url":"/xaml/containers/block","title":"Xaml.Block"},{"url":"/xaml/containers/dropdownmenu","title":"Xaml.DropDownMenu"},{"url":"/xaml/containers/grid","title":"Xaml.Grid"},{"url":"/xaml/containers/index","title":"XAML. Контейнеры"},{"url":"/xaml/containers/splitter","title":"Xaml.Splitter"},{"url":"/xaml/containers/stackpanel","title":"Xaml.StackPanel"},{"url":"/xaml/controls/button","title":"Xaml.Button"},{"url":"/xaml/controls/checkbox","title":"Xaml.CheckBox"},{"url":"/xaml/controls/datagrid","title":"Xaml.DataGrid"},{"url":"/xaml/controls/index","title":"XAML. Элементы управления"},{"url":"/xaml/controls/menuitem","title":"Xaml.MenuItem"},{"url":"/xaml/controls/radio","title":"Xaml.Radio"},{"url":"/xaml/controls/selector","title":"Xaml.Selector"},{"url":"/xaml/controls/table","title":"Xaml.Table"},{"url":"/xaml/text/break","title":"Xaml.Break"},{"url":"/xaml/text/hyperlink","title":"Xaml.Hyperlink"},{"url":"/xaml/text/index","title":"XAML. Текстовые управления"},{"url":"/xaml/text/line","title":"Xaml.Line"},{"url":"/xaml/text/popover","title":"Xaml.Popover"},{"url":"/xaml/text/span","title":"Xaml.Span"},{"url":"/xaml/text/taglabel","title":"Xaml.TagLabel"},{"url":"/xaml/text/text","title":"Xaml.Text"}];
const index = {"Block":[16],"Break":[30],"Button":[22],"CheckBox":[23],"commands":[6],"Controls":[25],"DataGrid":[24],"DropDownMenu":[17],"events":[7],"Grid":[18],"Grid.Col":[18],"Grid.ColSpan":[18],"Grid.Row":[18],"Grid.RowSpan":[18],"Hyperlink":[31],"Inlines":[32],"Line":[33],"MenuItem":[26],"model.json":[5],"Popover":[34],"properties":[9],"Radio":[27],"Selector":[28],"Span":[35],"Splitter":[20],"StackPanel":[21],"Table":[29],"TagLabel":[36],"template":[8],"Text":[37],"validators":[10],"Валидаторы":[10],"Команды":[6],"Контейнеры":[19],"Модели":[4],"Модели данных":[3],"Свойства":[9],"События":[7],"Текстовые элементы":[32],"Что нового":[12,13,14],"Шаблон":[8],"Элементы управления":[25]};
const fts = {"платформа":[0],"а2v10":[0],"представляет":[0,16,17,18,20,21],"собой":[0,16,17,18,20,21],"инструментальное":[0],"средство":[0],"предназначенное":[0],"разработки":[0],"прикладных":[0],"решений":[0],"связанных":[0],"автоматизацией":[0],"учета":[0],"управления":[0,16,18,22,23,24,25,26,27,28,29],"предприятием":[0],"справочная":[0,1],"система":[0,1],"рассчитана":[0],"тех":[0],"разрабатывает":[0],"устанавливает":[0],"настраивает":[0],"обслуживает":[0],"прикладные":[0],"решения":[0],"построенные":[0],"этой":[0],"программной":[0],"платформе":[0,12],"обратите":[0],"внимание":[0],"справочной":[0,1,13],"системе":[0,1],"содержится":[0],"информация":[0],"конечных":[0],"пользователей":[0],"включает":[0],"описание":[0,18],"принципов":[0],"построения":[0],"платформы":[0,12],"объектной":[0],"модели":[0,3,4,13],"свойствах/методах/событиях":[0],"структуры":[0],"базы":[0],"данных":[0,3,13,14,18,25],"нового":[0,12],"краткая":[0],"последних":[0],"изменениях":[0],"документации":[0],"создана":[1],"использованием":[1,13],"программного":[1],"обеспечения":[1],"открытым":[1],"исходным":[1],"кодом:":[1],"vue.js":[1],"copyright":[1],"2014":[1],"2018":[1,12,13,14],"evan":[1],"you":[1],"домашняя":[1],"страница":[1],"лицензия":[1],"контроллеры":[2],"файл":[5,13],"model.json":[5,13],"шаблоны":[6,7,8,9,10,13],"команды":[6],"события":[7],"свойства":[9,16,17,18,20,21],"валидаторы":[10],"представления":[11,15],"а2":[12],"этом":[12],"разделе":[12],"описываются":[12],"последние":[12],"изменения":[12,25],"дополнения":[12],"программах":[12],"версии":[12,13,14],"10":[12],"текущий":[12],"номер":[12,18],"отображается":[12],"правом":[12],"нижнем":[12],"углу":[12],"окна":[12],"браузера":[12],"выпуск":[12,13,14],"1":[12,13,18],"февраль":[12,13],"2":[12,14],"март":[12,14],"7109":[13],"7119":[13],"выпуски":[13,14],"|":[13,14],"предыдущий":[13,14],"следующий":[13,14],"общие":[13,14],"исправлена":[13],"ошибка":[13],"которой":[13],"нельзя":[13],"было":[13],"очистить":[13],"фильтр":[13],"перезагрузки":[13],"страницы":[13],"добавлены":[13],"темы":[13],"пользовательского":[13,18],"интерфейса":[13,18],"добавлена":[13],"возможность":[13],"работы":[13,14],"пользовательской":[13],"системой":[13],"теперь":[13],"при":[13],"открытии":[13],"элемента":[13,18,32],"новом":[13],"окне":[13],"кнопка":[13,25],"закрыть":[13],"закрывает":[13],"окно":[13],"пытается":[13],"перейти":[13],"предыдущую":[13],"страницу":[13],"можно":[13],"открыть":[13],"диалог":[13],"приводило":[13],"к":[13,18],"непредсказуемому":[13],"поведению":[13],"модель":[13,14],"описания":[13],"параметры":[13],"моделей":[13],"действиях":[13],"actions":[13],"работала":[13],"локализация":[13],"объектах":[13],"вложенными":[13],"свойствами":[13],"например":[13],"таком":[13],"свойстве:":[13],"agent.name":[13],"tagent":[13],"name":[13],"включаемых":[13],"модулях":[13],"require":[13],"xaml":[13,14,15],"неправильно":[13],"работало":[13],"свойство":[13,18],"disabled":[13],"объекта":[13],"menuitem":[13,25,26],"элемент":[13,14,16,17,18,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37],"dropdownmenu":[13,17,19],"поддерживает":[13],"itemssource":[13],"привязках":[13],"указанным":[13],"форматом":[13],"исправлено":[13],"правой":[13],"нижней":[13],"панели":[13,20],"splitter":[13,19,20],"задавать":[13],"минимально":[13],"допустимую":[13],"ширину":[13],"только":[13],"чтение":[13],"запрещался":[13],"selector":[13,25,28],"добавлен":[13,14],"taglabel":[13,32,36],"tabindex":[13],"кнопок":[13],"button":[13,22,25],"радиокнопок":[13],"radio":[13,25,27],"флажков":[13],"checkbox":[13,23,25],"добавлено":[13],"helpurl":[13],"tablemarkcell":[13],"tablerow":[13],"mark":[13],"объекте":[13],"grid":[13,18,19],"колонок":[13,18],"высоту":[13],"строк":[13,18],"c":[13],"единиц":[13],"измерения":[13],"rem":[13],"em":[13],"отрицание":[13],"условия":[13],"вложенных":[13],"элементов":[13,18,19],"привязки":[13,18],"команд":[13],"bindcmd":[13],"checkargument":[13],"7122":[14],"7126":[14],"модули":[14],"утилиты":[14],"датами":[14],"метод":[14],"add":[14],"staticimage":[14],"block":[16,19],"контейнеры":[16,17,18,19,20,21],"контейнер":[16,18,20,21],"содержит":[16],"другие":[16],"элементы":[16,18,19,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37],"выпадающее":[17,19],"меню":[17,19,25],"сетку":[18],"примечание":[18],"используется":[18],"макетах":[18],"предназначен":[18],"отображения":[18,25,32],"данным":[18],"используйте":[18],"соответствующие":[18],"упрвления":[18],"как":[18],"table":[18,25,29],"datagrid":[18,24,25],"имя":[18],"тип":[18],"children":[18],"uielementcollection":[18],"содержимого":[18],"коллекция":[18],"дочерних":[18],"сетки":[18],"унаследовано":[18],"от":[18],"contrainer":[18],"if":[18],"boolean":[18],"включать":[18],"ли":[18],"поток":[18],"рендеринга":[18],"height":[18],"length":[18],"высота":[18],"rows":[18],"rowdefinitions":[18],"определения":[18],"columns":[18],"columndefinitions":[18],"присоединенные":[18,20],"row":[18],"int32":[18],"определяет":[18],"строки":[18,32],"которую":[18],"должен":[18],"быть":[18],"помещен":[18],"дочерний":[18],"col":[18],"колонки":[18],"rowspan":[18],"количество":[18],"будет":[18],"занимать":[18],"умолчанию":[18],"colspan":[18],"valign":[18],"verticalalign":[18],"вертикальное":[18],"выравнивание":[18],"дочернего":[18],"таблицы":[18],"top":[18],"контейнерные":[19],"используются":[19,25,32],"размещения":[19],"блок":[19],"stackpanel":[19,21],"панель":[19],"сетка":[19],"разделитель":[19],"содержащий":[20],"две":[20],"изменяемыми":[20],"размерами":[20],"котором":[21],"дочерние":[21],"выравниваются":[21],"одну":[21],"линию":[21],"ориентированную":[21],"вертикально":[21],"горизонтально":[21],"controls":[25],"ввода":[25],"радиокнопка":[25],"флажок":[25],"селектор":[25],"таблица":[25],"break":[30,32],"текстовые":[30,31,32,33,34,35,36,37],"hyperlink":[31,32],"inlines":[32],"текста/картинок":[32],"text":[32,37],"текст":[32],"span":[32,35],"строчный":[32],"метка":[32],"тег":[32],"ссылка":[32],"popover":[32,34],"всплывающего":[32],"перенос":[32],"line":[32,33],"горизонтальная":[32],"линия":[32]};
window.app = {content: content, files: files, index: index, fts: fts};
})();